<a href="https://colab.research.google.com/github/jeffleon/Python_Google_Colab/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Exercise 1 Pandas Introduction**
- Series
- Data Frames

In [0]:
import pandas as pd
import numpy as np
import random

## **Series :**

**1. creacion de una serie**

In [0]:
serie_1 = pd.Series([3 , 4 , 5, 6, 7 , 8])
serie_1

0    3
1    4
2    5
3    6
4    7
5    8
dtype: int64

- *para colocar un indice a la serie es necesario hacerlo de dos maneras*
  1. ```
  serie = pd.Series([serie], index = [indices])
```
  2. ```
  elementos = {'Archery': 'Bhutan',
                'Golf': 'Scotland',
                'Sumo': 'Japan',
                'Taekwondo': 'South Korea'}
  serie = pd.Series(elementos)
```
**el numero de indices debe coincidir con el numero de elementos de la lista*
**en el segundo ejemplo la primera columna se convertirian en los indices*

In [0]:
serie_2 = pd.Series(['Tigre', 'Perro' , 'Gato' , 'Leon'], index = ['#1' , '#2' , '#3' , '#4'])
serie_2

#1    Tigre
#2    Perro
#3     Gato
#4     Leon
dtype: object

In [0]:
elementos = {'Archery': 'Bhutan',
           'Golf': 'Scotland',
           'Sumo': 'Japan',
           'Taekwondo': 'South Korea'}
serie = pd.Series(elementos)
serie

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

**2. Accediendo a elementos de la serie**

*   **loc =>**  se accede por medio de los indices 
*   **iloc =>** se accede por la posicion del elemento

In [0]:
serie.loc['Golf'] , serie.loc['Sumo']

('Scotland', 'Japan')

In [0]:
 serie.iloc[1] , serie.iloc[2]

('Scotland', 'Japan')

In [0]:
Sports = pd.Series({'Archery': 'Bhutan',
           'Golf': 'Scotland',
           'Sumo': 'Japan',
           'Taekwondo': 'South Korea'})
ContriesLoveCricket = pd.Series(['Australia',
                                 'Barbados',
                                 'Pakistan',
                                 'England'], index = ['Cricket' , 'Cricket' , 'Cricket' , 'Cricket'])
all_countries = Sports.append(ContriesLoveCricket)

In [0]:
Sports

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [0]:
ContriesLoveCricket

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

In [0]:
all_countries

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object

## **Data Frames :**

**1. Creacion de un Data Frame** un data frame es la union de varias series


```
 df = pd.DataFrame([Serie_1 , Serie_2, Serie_3], index=[Indices])
```

In [0]:
purchase_1 = pd.Series({'Name': 'Chris ',
                        'Item': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3] , index=['Store 1', 'Store 2', 'Store 3'])
df

           Name          Item  Cost
Store 1  Chris       Dog Food  22.5
Store 2   Kevyn  Kitty Litter   2.5
Store 3   Vinod     Bird Seed   5.0

**2. Accediendo a elementos de la serie**

*   **loc =>**  se accede por medio de los indices 
*   **iloc =>** se accede por la posicion del elemento

The same

In [0]:
df.loc['Store 1', 'Cost']

22.5

In [0]:
df.loc['Store 1']['Cost']

22.5

In [0]:
df.loc['Store 2':, ['Name','Cost']]

          Name  Cost
Store 2  Kevyn   2.5
Store 3  Vinod   5.0

In [0]:
purchase_1 = pd.Series({'Name': 'Chris ',
                        'Item': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item': 'Kitty Litter',
                        'Cost': 10.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item': 'Bird Seed',
                        'Cost': 15.00})
purchase_4 = pd.Series({'Name': 'Heidis',
                        'Item': 'Sea Food',
                        'Cost': 50.00})
purchase_5 = pd.Series({'Name': 'Vicnolo',
                        'Item': 'Coco Food',
                        'Cost': 30.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3, purchase_4, purchase_5] , 
                    index=['Store 1', 'Store 2', 'Store 3', 'Store 4', 'Store 5'])
df

            Name          Item  Cost
Store 1   Chris       Dog Food  22.5
Store 2    Kevyn  Kitty Litter  10.5
Store 3    Vinod     Bird Seed  15.0
Store 4   Heidis      Sea Food  50.0
Store 5  Vicnolo     Coco Food  30.0

In [0]:
df[df['Cost'] > 30]

           Name      Item  Cost
Store 4  Heidis  Sea Food  50.0

In [0]:
df['Cost'].count()

5

In [0]:
df = df.set_index('Item')

In [0]:
df

                 Name  Cost
Item
Dog Food       Chris   22.5
Kitty Litter    Kevyn  10.5
Bird Seed       Vinod  15.0
Sea Food       Heidis  50.0
Coco Food     Vicnolo  30.0

In [0]:
df = df.sort_index()

In [0]:
df

                 Name  Cost
Item
Bird Seed       Vinod  15.0
Coco Food     Vicnolo  30.0
Dog Food       Chris   22.5
Kitty Litter    Kevyn  10.5
Sea Food       Heidis  50.0

In [0]:
df.loc['Bird Seed' , ['Cost']] = 30
df

                 Name  Cost
Item
Bird Seed       Vinod  30.0
Coco Food     Vicnolo  30.0
Dog Food       Chris   22.5
Kitty Litter    Kevyn  10.5
Sea Food       Heidis  50.0

In [0]:
df['Cost'].unique()

array([30. , 22.5, 10.5, 50. ])

In [0]:
purchase_1 = pd.Series({'Name': 'Chris ',
                        'Item': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item': 'Kitty Litter',
                        'Cost': 10.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item': 'Bird Seed',
                        'Cost': 15.00})
purchase_4 = pd.Series({'Name': 'Heidis',
                        'Item': 'Sea Food',
                        'Cost': 50.00})
purchase_5 = pd.Series({'Name': 'Vicnolo',
                        'Item': np.nan,
                        'Cost': 30.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3, purchase_4, purchase_5] , 
                    index=['Store 1', 'Store 2', 'Store 3', 'Store 4', 'Store 5'])
df

            Name          Item  Cost
Store 1   Chris       Dog Food  22.5
Store 2    Kevyn  Kitty Litter  10.5
Store 3    Vinod     Bird Seed  15.0
Store 4   Heidis      Sea Food  50.0
Store 5  Vicnolo           NaN  30.0

In [0]:
df = df.fillna(method='ffill')
df

            Name          Item  Cost
Store 1   Chris       Dog Food  22.5
Store 2    Kevyn  Kitty Litter  10.5
Store 3    Vinod     Bird Seed  15.0
Store 4   Heidis      Sea Food  50.0
Store 5  Vicnolo      Sea Food  30.0